&НаСервере
Процедура ОбновитьИсториюФинансовыхОпераций()
	ИсторияФинансовыхОпераций.Очистить();
	//
	Выручка = 0;
	Списание = 0;
	Прибыль = 0;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеДС.Сумма КАК Сумма,
	               |	ПоступлениеДС.Пояснение КАК Пояснение,
	               |	ПоступлениеДС.Ссылка КАК Ссылка,
	               |	ПоступлениеДС.Дата КАК Дата
	               |ИЗ
	               |	Документ.ПоступлениеДС КАК ПоступлениеДС
	               |ГДЕ
	               |	ПоступлениеДС.Заказ = &Заказ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеДС.Сумма,
	               |	СписаниеДС.Пояснение,
	               |	СписаниеДС.Ссылка,
	               |	СписаниеДС.Дата
	               |ИЗ
	               |	Документ.СписаниеДС КАК СписаниеДС
	               |ГДЕ
	               |	СписаниеДС.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ТЧ = ИсторияФинансовыхОпераций.Добавить();
		ТЧ.ДатаОперации = ВыборкаЗапроса.Дата;
		Если ТипЗнч(ВыборкаЗапроса.Ссылка) = Тип("ДокументСсылка.ПоступлениеДС") Тогда
			ТЧ.ВидФинансовойОперации = Перечисления.ВидыФинансовыхОпераций.Поступление;
			//
			Выручка = Выручка + ВыборкаЗапроса.Сумма;
		ИначеЕсли ТипЗнч(ВыборкаЗапроса.Ссылка) = Тип("ДокументСсылка.СписаниеДС") Тогда
			ТЧ.ВидФинансовойОперации = Перечисления.ВидыФинансовыхОпераций.Списание;
			Списание = Списание + ВыборкаЗапроса.Сумма;
		КонецЕсли;
		ТЧ.Сумма = ВыборкаЗапроса.Сумма;
		ТЧ.Пояснение = ВыборкаЗапроса.Пояснение;
	КонецЦикла;
	//
	Прибыль = Выручка - Списание;
	//
	Если Прибыль = Заказ.СуммаДокумента Тогда
		ОбъектЗаказ = Заказ.ПолучитьОбъект();
		ОбъектЗаказ.СтатусЗаказа = Перечисления.СтатусыЗаказа.ЗавершёнИОплачен;
		ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заказ = Параметры.Документ;
	ОбновитьИсториюФинансовыхОпераций();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОперацию(Команда)
	СоздатьОперациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОперациюНаСервере()
	Если ВидОперации = Перечисления.ВидыФинансовыхОпераций.Поступление Тогда
		Док = Документы.ПоступлениеДС.СоздатьДокумент();
	ИначеЕсли ВидОперации = Перечисления.ВидыФинансовыхОпераций.Списание Тогда
		Док = Документы.СписаниеДС.СоздатьДокумент();
	КонецЕсли;
	Док.Дата = ТекущаяДата();
	Док.Заказ = Заказ;
	Док.Сумма = Сумма;
	Док.Пояснение = Пояснение;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	//
	Сумма = 0;
	Пояснение = "";
	ВидОперации = Перечисления.ВидыФинансовыхОпераций.ПустаяСсылка();
	//
	ОбновитьИсториюФинансовыхОпераций();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ИсторияФинансовыхОперацийЗакрыта",Ложь,ЭтаФорма);
КонецПроцедуры
