
Процедура ОбновитьКурсыВалют() Экспорт
	Адрес =  "www.cbr-xml-daily.ru";
	ЗС = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(Адрес,,,,,,ЗС,);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("/daily_json.js",Заголовки);
	Результат = HTTPСоединение.Получить(HTTPЗапрос,"");
	Ответ = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ);
	Курсы = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Для Каждого Курс Из Курсы.Valute Цикл
		Валюта = Справочники.Валюты.НайтиПоНаименованию(Курс.Ключ);
		Если Валюта <> Справочники.Валюты.ПустаяСсылка() Тогда
			МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Валюта = Валюта;
			МенеджерЗаписи.Курс = Курс.Значение.Value;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры