&НаКлиенте
Перем ЭтапРегистрации;


&НаСервере
Функция ЗаписатьДанныеКонтрагента(Контрагент)
	МенеджерЗаписи = РегистрыСведений.ДанныеКонтрагентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.ИНН = ИНН;
	Если ЭтотОбъект.ФизическоеЛицо Тогда
		МенеджерЗаписи.ТипКонтрагента = Перечисления.ТипыКонтрагентов.ФизическоеЛицо;
		МенеджерЗаписи.Фамилия = ЭтотОбъект.Фамилия;
		МенеджерЗаписи.Имя = ЭтотОбъект.Имя;
		МенеджерЗаписи.Отчество = ЭтотОбъект.Отчество;
		МенеджерЗаписи.ДатаРождения = ЭтотОбъект.ДатаРождения;
		МенеджерЗаписи.Псевдоним = ЭтотОбъект.Псевдоним;
	ИначеЕсли ЭтотОбъект.ЮридическоеЛицо Тогда
		МенеджерЗаписи.ТипКонтрагента = Перечисления.ТипыКонтрагентов.ЮридическоеЛицо;
		Если АО Тогда
			МенеджерЗаписи.ВидЮридическогоЛица = Перечисления.ВидыЮридическихЛиц.АО;
		ИначеЕсли ИП Тогда
			МенеджерЗаписи.ВидЮридическогоЛица = Перечисления.ВидыЮридическихЛиц.ИП;
		ИначеЕсли ООО Тогда
			МенеджерЗаписи.ВидЮридическогоЛица = Перечисления.ВидыЮридическихЛиц.ООО;
		ИначеЕсли НПД Тогда
			МенеджерЗаписи.ВидЮридическогоЛица = Перечисления.ВидыЮридическихЛиц.НПД;
			МенеджерЗаписи.Фамилия = ЭтотОбъект.Фамилия;
			МенеджерЗаписи.Имя = ЭтотОбъект.Имя;
			МенеджерЗаписи.Отчество = ЭтотОбъект.Отчество;
		ИначеЕсли Другое Тогда
			МенеджерЗаписи.ВидЮридическогоЛица = Перечисления.ВидыЮридическихЛиц.Другое;
		КонецЕсли;
		МенеджерЗаписи.НаименованиеЮридическогоЛица = ЭтотОбъект.НаименованиеЮридическогоЛица;
	КонецЕсли;
	//
	МенеджерЗаписи.Записать();
КонецФункции

&НаСервере
Функция ЗаписатьКонтактныеДанные(Контрагент)
	Для Каждого Стр Из ЭтотОбъект.КонтактнаяИнформацияКонтрагента Цикл
		МенеджерЗаписи = РегистрыСведений.КонтактныеДанныеКонтрагентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Контрагент = Контрагент;
		МенеджерЗаписи.ВидКонтактнойИнформации = Стр.ВидКонтактнойИнформации;
		МенеджерЗаписи.Значение = Стр.Значение;
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецФункции

&НаСервере
Функция ЗаписатьФинансовыеДанные(Контрагент)
	МенеджерЗаписи = РегистрыСведений.ТарифныеСтавкиКонтрагентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Валюта = ВалютаВзаиморасчётов;
	МенеджерЗаписи.Значение = ТарифнаяСтавка;
	МенеджерЗаписи.Записать();
КонецФункции

&НаСервере
Функция СоздатьКонтрагента()
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	//
	Если ЭтотОбъект.ФизическоеЛицо Или ЭтотОбъект.НПД Тогда
		Контрагент.Наименование = ЭтотОбъект.Фамилия + " " + ЭтотОбъект.Имя + " " + ЭтотОбъект.Отчество;
		Контрагент.Записать();
	ИначеЕсли ЭтотОбъект.ЮридическоеЛицо Тогда
		Контрагент.Наименование = ЭтотОбъект.НаименованиеЮридическогоЛица;
		Контрагент.Записать();
	КонецЕсли;
	//
	ЗаписатьДанныеКонтрагента(Контрагент.Ссылка);
	ЗаписатьКонтактныеДанные(Контрагент.Ссылка);
	ЗаписатьФинансовыеДанные(Контрагент.Ссылка);
	//
	Возврат Контрагент.Ссылка;
КонецФункции

&НаКлиенте
Процедура Далее(Команда)
	Если ЭтапРегистрации = 0 Тогда
		ЭтаФорма.Элементы.ГруппаНачальныйЭкран.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаТипКонтрагента.Видимость = Истина;
	ИначеЕсли ЭтапРегистрации = 1 Тогда
		Если ЭтотОбъект.ФизическоеЛицо Тогда
			ЭтаФорма.Элементы.ГруппаТипКонтрагента.Видимость = Ложь;
			ЭтаФорма.Элементы.ГруппаДанныеФизическогоЛица.Видимость = Истина;
		Иначе
			ЭтаФорма.Элементы.ГруппаТипКонтрагента.Видимость = Ложь;
			ЭтаФорма.Элементы.ГруппаДанныеЮридическогоЛица.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли ЭтапРегистрации = 2 Тогда
		ЭтаФорма.Элементы.ГруппаДанныеФизическогоЛица.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаДанныеЮридическогоЛица.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаКонтактнаяИнформация.Видимость = Истина;
	ИначеЕсли ЭтапРегистрации = 3 Тогда
		ЭтаФорма.Элементы.ГруппаКонтактнаяИнформация.Видимость = Ложь;
		СсылкаНаКонтрагента = СоздатьКонтрагента();
		ЭтаФорма.Элементы.ГруппаЗавершение.Видимость = Истина;
		ЭтаФорма.Элементы.Далее.Заголовок = "Закрыть";
	ИначеЕсли ЭтапРегистрации = 5 Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	//
	ЭтапРегистрации = ЭтапРегистрации + 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.ФизическоеЛицо = Истина;
	ЭтапРегистрации = 0;
	ИП = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ЭтотОбъект.ЮридическоеЛицо = Не ЭтотОбъект.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоПриИзменении(Элемент)
	ЭтотОбъект.ФизическоеЛицо = Не ЭтотОбъект.ЮридическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ИППриИзменении(Элемент)
	Если ИП Тогда
		ООО = Ложь;
		АО = Ложь;
		НПД = Ложь;
		Другое = Ложь;
		ЭтаФорма.Элементы.НаименованиеЮридическогоЛица.Видимость = Истина;
		ЭтаФорма.Элементы.ФамилияНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ИмяНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ОтчествоНПД.Видимость = Ложь;
	Иначе
		Другое = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОООПриИзменении(Элемент)
	Если ООО Тогда
		ИП = Ложь;
		АО = Ложь;
		НПД = Ложь;
		Другое = Ложь;
		ЭтаФорма.Элементы.НаименованиеЮридическогоЛица.Видимость = Истина;
		ЭтаФорма.Элементы.ФамилияНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ИмяНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ОтчествоНПД.Видимость = Ложь;
	Иначе
		Другое = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АОПриИзменении(Элемент)
	Если АО Тогда
		ИП = Ложь;
		ООО = Ложь;
		НПД = Ложь;
		Другое = Ложь;
		ЭтаФорма.Элементы.НаименованиеЮридическогоЛица.Видимость = Истина;
		ЭтаФорма.Элементы.ФамилияНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ИмяНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ОтчествоНПД.Видимость = Ложь;
	Иначе
		Другое = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НПДПриИзменении(Элемент)
	Если НПД Тогда
		ИП = Ложь;
		ООО = Ложь;
		АО = Ложь;
		Другое = Ложь;
		ЭтаФорма.Элементы.НаименованиеЮридическогоЛица.Видимость = Ложь;
		ЭтаФорма.Элементы.ФамилияНПД.Видимость = Истина;
		ЭтаФорма.Элементы.ИмяНПД.Видимость = Истина;
		ЭтаФорма.Элементы.ОтчествоНПД.Видимость = Истина;
	Иначе
		Другое = Истина;
		ЭтаФорма.Элементы.НаименованиеЮридическогоЛица.Видимость = Истина;;
		ЭтаФорма.Элементы.ФамилияНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ИмяНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ОтчествоНПД.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДругоеПриИзменении(Элемент)
	Если Другое Тогда
		ИП = Ложь;
		ООО = Ложь;
		НПД = Ложь;
		АО = Ложь;
		ЭтаФорма.Элементы.НаименованиеЮридическогоЛица.Видимость = Истина;
		ЭтаФорма.Элементы.ФамилияНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ИмяНПД.Видимость = Ложь;
		ЭтаФорма.Элементы.ОтчествоНПД.Видимость = Ложь;
	Иначе
		ИП = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("КонтрагентСоздан",Истина,ЭтаФорма);
КонецПроцедуры
