&НаСервере
Функция ПолучитьСсылкуЗаказаПоНомеру(Номер)
	Возврат Документы.Заказ.НайтиПоНомеру(Номер);
КонецФункции

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	ОткрытьФорму("Обработка.МастерРегистрацииКонтрагентов.Форма.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КонтрагентСоздан" Тогда
		ЭтаФорма.Элементы.Контрагенты.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказЗарегистрирован" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказПолностьюОплачен" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказОплаченЧастично" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказУчтён" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказУдалён" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказПомеченНаУдаление" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказВзятВИсполнение" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказОтменён" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ИсторияФинансовыхОперацийЗакрыта" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	ИначеЕсли ИмяСобытия = "ЗаказЗакрыт" Тогда
		ЭтаФорма.Элементы.Заказы.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	ОткрытьФорму("Обработка.МастерРегистрацииЗаказов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУслугу(Команда)
	//
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДляТестов(Команда)
	ОткрытьФорму("РегистрСведений.ФинансоваяИнформацияДенежныхСчетов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура АктВыполненныхРабот(Команда)
	//Попытка
		ТД = ЭтаФорма.Элементы.Заказы.ТекущиеДанные;
		//
		ТабДок = Новый ТабличныйДокумент;
		//
		Акт = ПечатныеФормы.ЗаполнитьАктВыполненныхРабот(ТабДок,ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));	
		//
		ТабДок = Акт.ТабДок;
		//
		ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытия.Каталог = ""; 
		ДиалогОткрытия.МножественныйВыбор = Ложь; 
		ДиалогОткрытия.Заголовок = "Выберите каталог"; 
		
		Если ДиалогОткрытия.Выбрать() Тогда 
			ПутьККаталогу = ДиалогОткрытия.Каталог; 
		КонецЕсли;
		ТабДок.Записать(Строка(ПутьККаталогу)+"\"+Строка(Акт.Название),ТипФайлаТабличногоДокумента.XLS);
	//Исключение
		//
	//КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияФинансовыхОпераций(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	ОткрытьФорму("ОбщаяФорма.ФинансовыеОперацииПоЗаказу",Новый Структура("Документ",ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер)),ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ОплатитьПолностьюНаСервере(Ссылка)
	Заказ = Ссылка.ПолучитьОбъект();
	Выручка = 0;
	Списание = 0;
	Прибыль = 0;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеДС.Сумма КАК Сумма,
	               |	ПоступлениеДС.Пояснение КАК Пояснение,
	               |	ПоступлениеДС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеДС КАК ПоступлениеДС
	               |ГДЕ
	               |	ПоступлениеДС.Заказ = &Заказ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеДС.Сумма,
	               |	СписаниеДС.Пояснение,
	               |	СписаниеДС.Ссылка
	               |ИЗ
	               |	Документ.СписаниеДС КАК СписаниеДС
	               |ГДЕ
	               |	СписаниеДС.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если ТипЗнч(ВыборкаЗапроса.Ссылка) = Тип("ДокументСсылка.ПоступлениеДС") Тогда
			Выручка = Выручка + ВыборкаЗапроса.Сумма;
		ИначеЕсли ТипЗнч(ВыборкаЗапроса.Ссылка) = Тип("ДокументСсылка.СписаниеДС") Тогда
			Списание = Списание + ВыборкаЗапроса.Сумма;
		КонецЕсли;
	КонецЦикла;
	//
	Прибыль = Выручка - Списание;
	//
	Если Прибыль < Заказ.СуммаДокумента Тогда
		Док = Документы.ПоступлениеДС.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Заказ = Ссылка;
		Док.Сумма = Заказ.СуммаДокумента - Прибыль;
		Док.Пояснение = "Создано автоматически";
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	//
	Заказ.СтатусЗаказа = Перечисления.СтатусыЗаказа.ЗавершёнИОплачен;
	Заказ.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьПолностью(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	ОплатитьПолностьюНаСервере(ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	Оповестить("ЗаказПолностьюОплачен",Ложь,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеВводаЧисла(Результат, Параметры) Экспорт
 
    Если Не Результат = Неопределено Тогда
        Док = Документы.ПоступлениеДС.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Заказ = Параметры;
		Док.Сумма = Результат;
		Док.Пояснение = "Создано автоматически!";
		Док.Записать(РежимЗаписиДокумента.Проведение);
    КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьЧастично(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	//
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЧисла",ЭтотОбъект,ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	//
	ПоказатьВводЧисла(Оповещение,,"Введите полученную сумму",15,3);
	//
	Оповестить("ЗаказОплаченЧастично",Ложь,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура УчестьНаСервере(Ссылка)
	ОбъектДок = Ссылка.ПолучитьОбъект();
	ОбъектДок.ПометкаУдаления = Ложь;
	ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура Учесть(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	УчестьНаСервере(ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	Оповестить("ЗаказУчтён",Ложь,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(Ссылка)
	ОбъектДок = Ссылка.ПолучитьОбъект();
	ОбъектДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	ОбъектДок.Удалить();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	УдалитьНаСервере(ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	Оповестить("ЗаказУдалён",Ложь,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеНаСервере(Ссылка)
	ОбъектДок = Ссылка.ПолучитьОбъект();
	ОбъектДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	ОбъектДок.ПометкаУдаления = Истина;
	ОбъектДок.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	ПометитьНаУдалениеНаСервере(ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	Оповестить("ЗаказПомеченНаУдаление",Ложь,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриступитьКИсполнениюНаСервере(Ссылка)
	ОбъектДок = Ссылка.ПолучитьОбъект();
	ОбъектДок.СтатусЗаказа = Перечисления.СтатусыЗаказа.ВИсполнении;
	ОбъектДок.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура ПриступитьКИсполнению(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	ПриступитьКИсполнениюНаСервере(ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	Оповестить("ЗаказВзятВИсполнение",Ложь,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере(Ссылка)
	ОбъектДок = Ссылка.ПолучитьОбъект();
	ОбъектДок.СтатусЗаказа = Перечисления.СтатусыЗаказа.Отменён;
	ОбъектДок.Записать(РежимЗаписиДокумента.Запись);	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ТД = Элементы.Заказы.ТекущиеДанные;
	ОтменитьНаСервере(ПолучитьСсылкуЗаказаПоНомеру(ТД.Номер));
	Оповестить("ЗаказОтменён",Ложь,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДляТестов2(Команда)
	ОткрытьФорму("ОбщаяФорма.СведенияОВладельце");
КонецПроцедуры







