
Процедура ПередЗаписью(Отказ)
	Если СчетПоУмолчанию Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДенежныеСчета.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ДенежныеСчета КАК ДенежныеСчета
		               |ГДЕ
		               |	ДенежныеСчета.СчетПоУмолчанию = &СчетПоУмолчанию
		               |	И ДенежныеСчета.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("СчетПоУмолчанию",Истина);
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ОбъектСпр = ВыборкаЗапроса.Ссылка.ПолучитьОбъект();
			ОбъектСпр.СчетПоУмолчанию = Ложь;
			ОбъектСпр.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
