&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭлектроннаяПочтаПриИзменении(Элемент)
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСчетаПриИзменении(Элемент)
	//ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	МенеджерЗаписи = РегистрыСведений.ДанныеОВладельце.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.Фамилия;
	МенеджерЗаписи.Значение = Фамилия;
	МенеджерЗаписи.Записать();
	//
	МенеджерЗаписи = РегистрыСведений.ДанныеОВладельце.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.Имя;
	МенеджерЗаписи.Значение = Имя;
	МенеджерЗаписи.Записать();
	//
	МенеджерЗаписи = РегистрыСведений.ДанныеОВладельце.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.Отчество;
	МенеджерЗаписи.Значение = Отчество;
	МенеджерЗаписи.Записать();
	//
	МенеджерЗаписи = РегистрыСведений.ДанныеОВладельце.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.НомерТелефона;
	МенеджерЗаписи.Значение = НомерТелефона;
	МенеджерЗаписи.Записать();
	//
	МенеджерЗаписи = РегистрыСведений.ДанныеОВладельце.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.ЭлектроннаяПочта;
	МенеджерЗаписи.Значение = ЭлектроннаяПочта;
	МенеджерЗаписи.Записать();
	//
	МенеджерЗаписи = РегистрыСведений.ДанныеОВладельце.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.ИНН;
	МенеджерЗаписи.Значение = ИНН;
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаСервере();
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ВидыИнформацииОВладельце = Новый Массив;
	ВидыИнформацииОВладельце.Добавить(Справочники.ВидыИнформацииОВладельце.Фамилия);
	ВидыИнформацииОВладельце.Добавить(Справочники.ВидыИнформацииОВладельце.Имя);
	ВидыИнформацииОВладельце.Добавить(Справочники.ВидыИнформацииОВладельце.Отчество);
	ВидыИнформацииОВладельце.Добавить(Справочники.ВидыИнформацииОВладельце.ИНН);
	ВидыИнформацииОВладельце.Добавить(Справочники.ВидыИнформацииОВладельце.НомерТелефона);
	ВидыИнформацииОВладельце.Добавить(Справочники.ВидыИнформацииОВладельце.ЭлектроннаяПочта);
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеОВладельцеСрезПоследних.ВидИнформацииОВладельце КАК ВидИнформацииОВладельце,
	               |	ДанныеОВладельцеСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДанныеОВладельце.СрезПоследних КАК ДанныеОВладельцеСрезПоследних
	               |ГДЕ
	               |	ДанныеОВладельцеСрезПоследних.ВидИнформацииОВладельце В(&ВидИнформацииОВладельце)";
	Запрос.УстановитьПараметр("ВидИнформацииОВладельце",ВидыИнформацииОВладельце);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если ВыборкаЗапроса.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.Фамилия Тогда
			Фамилия = ВыборкаЗапроса.Значение;
		ИначеЕсли ВыборкаЗапроса.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.Имя Тогда
			Имя = ВыборкаЗапроса.Значение;
		ИначеЕсли ВыборкаЗапроса.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.Отчество Тогда
			Отчество = ВыборкаЗапроса.Значение;
		ИначеЕсли ВыборкаЗапроса.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.ИНН Тогда
			ИНН = ВыборкаЗапроса.Значение;
		ИначеЕсли ВыборкаЗапроса.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.НомерТелефона Тогда
			НомерТелефона = ВыборкаЗапроса.Значение;
		ИначеЕсли ВыборкаЗапроса.ВидИнформацииОВладельце = Справочники.ВидыИнформацииОВладельце.ЭлектроннаяПочта Тогда
			ЭлектроннаяПочта = ВыборкаЗапроса.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДенежныйСчет(Команда)
	ОткрытьФорму("Обработка.МастерРегистрацииДенежныхСчетов.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ДенежныйСчётСоздан" Тогда
		ЭтаФорма.Элементы.ДенежныеСчета.Обновить();
	КонецЕсли;
КонецПроцедуры


