&НаСервере
Функция ОбновитьЦену()
	МенеджерЗаписи = РегистрыСведений.ЦеныУслуг.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Услуга = Объект.Ссылка;
	МенеджерЗаписи.ЕдиницаИзмерения = ЕдиницаИзмерения;
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.Записать();
КонецФункции

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЭтотОбъект.Записать();
	ЭтаФорма.Прочитать();
	РазрешитьРедактированиеПриИзменении(Ложь);
	ОбновитьЦену();
	РазрешитьРедактирование = Ложь;
	ЭтаФорма.Элементы.ДополнительныеФункции.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	ЭтаФорма.Элементы.Наименование.ТолькоПросмотр = Не ЭтаФорма.Элементы.Наименование.ТолькоПросмотр;
	ЭтаФорма.Элементы.ЕдиницаИзмерения.ТолькоПросмотр = Не ЭтаФорма.Элементы.ЕдиницаИзмерения.ТолькоПросмотр;
	ЭтаФорма.Элементы.Цена.ТолькоПросмотр = Не ЭтаФорма.Элементы.Цена.ТолькоПросмотр;
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Не ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныУслугСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЦеныУслугСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныУслуг.СрезПоследних КАК ЦеныУслугСрезПоследних
	               |ГДЕ
	               |	ЦеныУслугСрезПоследних.Услуга = &Услуга";
	Запрос.УстановитьПараметр("Услуга",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ЕдиницаИзмерения = ВыборкаЗапроса.ЕдиницаИзмерения;
		Цена = ВыборкаЗапроса.Цена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


