&НаКлиенте
Перем ЭтапРегистрации;

&НаСервере
Функция СоздатьУслугу()
	Эл = Справочники.Услуги.СоздатьЭлемент();
	Эл.Наименование = НаименованиеУслуги;
	Эл.Записать();
	Возврат Эл.Ссылка;
КонецФункции

&НаСервере
Функция УстановитьЦену()
	МенеджерЗаписи = РегистрыСведений.ЦеныУслуг.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Услуга = Услуга;
	МенеджерЗаписи.ЕдиницаИзмерения = ЕдиницаИзмеренияУслуги;
	МенеджерЗаписи.Цена = СтоимостьУслуги;
	МенеджерЗаписи.Записать();
КонецФункции

&НаКлиенте
Процедура Далее(Команда)
	Если ЭтапРегистрации = 0 Тогда
		ЭтаФорма.Элементы.ГруппаНачальныйЭкран.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаОсновныеСведения.Видимость = Истина;
	ИначеЕсли ЭтапРегистрации = 1 Тогда
		ЭтаФорма.Элементы.ГруппаОсновныеСведения.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаУстановкаЦены.Видимость = Истина;
	ИначеЕсли ЭтапРегистрации = 2 Тогда
		Услуга = СоздатьУслугу();
		УстановитьЦену();
		ЭтаФорма.Элементы.ГруппаУстановкаЦены.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЗавершение.Видимость = Истина;
		ЭтаФорма.Элементы.Далее.Заголовок = "Закрыть";
	ИначеЕсли ЭтапРегистрации = 3 Тогда
		Оповестить("УслугаСоздана",Истина,ЭтаФорма);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	//
	ЭтапРегистрации = ЭтапРегистрации + 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтапРегистрации = 0;
КонецПроцедуры
