&НаСервере
Функция ПолучитьБанковскийСчет()
	Возврат Перечисления.ТипыДенежныхСчетов.БанковскийСчёт;
КонецФункции

&НаСервере
Функция ПолучитьФизическийСчет()
	Возврат Перечисления.ТипыДенежныхСчетов.Физический;
КонецФункции

&НаСервере
Функция ПолучитьЭлектронныйКошелёк()
	Возврат Перечисления.ТипыДенежныхСчетов.ЭлектронныйКошелёк;
КонецФункции

&НаСервере
Процедура УстановитьИнформациюРеквизитов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФинансоваяИнформацияДенежныхСчетовСрезПоследних.ВидИнформации КАК ВидИнформации,
	               |	ФинансоваяИнформацияДенежныхСчетовСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ФинансоваяИнформацияДенежныхСчетов.СрезПоследних КАК ФинансоваяИнформацияДенежныхСчетовСрезПоследних
	               |ГДЕ
	               |	ФинансоваяИнформацияДенежныхСчетовСрезПоследних.ДенежныйСчёт = &ДенежныйСчёт";
	Запрос.УстановитьПараметр("ДенежныйСчёт",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если Объект.ТипДенежногоСчёта = Перечисления.ТипыДенежныхСчетов.Физический Тогда
			//
		ИначеЕсли Объект.ТипДенежногоСчёта = Перечисления.ТипыДенежныхСчетов.БанковскийСчёт Тогда
			Если ВыборкаЗапроса.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НаименованиеБанка Тогда
				НаименованиеБанка = ВыборкаЗапроса.Значение;
			ИначеЕсли ВыборкаЗапроса.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НомерКарты Тогда
				НомерКарты = ВыборкаЗапроса.Значение;
			КонецЕсли;
		ИначеЕсли Объект.ТипДенежногоСчёта = Перечисления.ТипыДенежныхСчетов.ЭлектронныйКошелёк Тогда
			Если ВыборкаЗапроса.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НаименованиеСервиса Тогда
				НаименованиеСервиса = ВыборкаЗапроса.Значение;
			ИначеЕсли ВыборкаЗапроса.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НомерСчёта Тогда
				НомерСчёта = ВыборкаЗапроса.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	ЭтаФорма.Элементы.Наименование.ТолькоПросмотр = Не ЭтаФорма.Элементы.Наименование.ТолькоПросмотр;
	ЭтаФорма.Элементы.СчетПоУмолчанию.ТолькоПросмотр = Не ЭтаФорма.Элементы.СчетПоУмолчанию.ТолькоПросмотр;
	ЭтаФорма.Элементы.ГруппаБанковскийСчёт.ТолькоПросмотр = Не ЭтаФорма.Элементы.ГруппаБанковскийСчёт.ТолькоПросмотр;
	ЭтаФорма.Элементы.ГруппаФизическийСчёт.ТолькоПросмотр = Не ЭтаФорма.Элементы.ГруппаФизическийСчёт.ТолькоПросмотр;
	ЭтаФорма.Элементы.ГруппаЭлектронныКошелёк.ТолькоПросмотр = Не ЭтаФорма.Элементы.ГруппаЭлектронныКошелёк.ТолькоПросмотр;
	//
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Не ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Если Объект.ТипДенежногоСчёта = ПолучитьБанковскийСчет() Тогда
		ЭтаФорма.Элементы.ГруппаБанковскийСчёт.Видимость = Истина;
	ИначеЕсли Объект.ТипДенежногоСчёта = ПолучитьФизическийСчет() Тогда
		ЭтаФорма.Элементы.ГруппаФизическийСчёт.Видимость = Истина;
	ИначеЕсли Объект.ТипДенежногоСчёта = ПолучитьЭлектронныйКошелёк() Тогда
		ЭтаФорма.Элементы.ГруппаЭлектронныКошелёк.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеВРегистрах()
	Если Объект.ТипДенежногоСчёта = Перечисления.ТипыДенежныхСчетов.Физический Тогда
		//
	ИначеЕсли Объект.ТипДенежногоСчёта = Перечисления.ТипыДенежныхСчетов.БанковскийСчёт Тогда
		МенеджерЗаписи = РегистрыСведений.ФинансоваяИнформацияДенежныхСчетов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.ДенежныйСчёт = Объект.Ссылка;
		МенеджерЗаписи.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НаименованиеБанка;
		МенеджерЗаписи.Значение = НаименованиеБанка;
		МенеджерЗаписи.Записать();
		//
		МенеджерЗаписи = РегистрыСведений.ФинансоваяИнформацияДенежныхСчетов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.ДенежныйСчёт = Объект.Ссылка;
		МенеджерЗаписи.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НомерКарты;
		МенеджерЗаписи.Значение = НомерКарты;
		МенеджерЗаписи.Записать();
	ИначеЕсли Объект.ТипДенежногоСчёта = Перечисления.ТипыДенежныхСчетов.ЭлектронныйКошелёк Тогда
		МенеджерЗаписи = РегистрыСведений.ФинансоваяИнформацияДенежныхСчетов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.ДенежныйСчёт = Объект.Ссылка;
		МенеджерЗаписи.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НаименованиеСервиса;
		МенеджерЗаписи.Значение = НаименованиеСервиса;
		МенеджерЗаписи.Записать();
		//
		МенеджерЗаписи = РегистрыСведений.ФинансоваяИнформацияДенежныхСчетов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.ДенежныйСчёт = Объект.Ссылка;
		МенеджерЗаписи.ВидИнформации = Справочники.ВидыИнформацииДенежныхСчетов.НомерСчёта;
		МенеджерЗаписи.Значение = НомерСчёта;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ОбновитьДанныеВРегистрах();
	//
	ЭтотОбъект.Записать();
	ЭтаФорма.Прочитать();
	УстановитьДоступностьЭлементов();
	//
	РазрешитьРедактирование = Ложь;
	ЭтаФорма.Элементы.ГруппаДополнительныеФункции.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
	УстановитьИнформациюРеквизитов();
КонецПроцедуры
