&НаСервере
Функция ПолучитьТарифнуюСтавку()
	ТарифнаяСтавкаСтруктура = Новый Структура;
	ТарифнаяСтавкаСтруктура.Вставить("Валюта",Справочники.Валюты.ПустаяСсылка());
	ТарифнаяСтавкаСтруктура.Вставить("Ставка",0);
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТарифныеСтавкиКонтрагентовСрезПоследних.Значение КАК Значение,
	               |	ТарифныеСтавкиКонтрагентовСрезПоследних.Валюта КАК Валюта
	               |ИЗ
	               |	РегистрСведений.ТарифныеСтавкиКонтрагентов.СрезПоследних КАК ТарифныеСтавкиКонтрагентовСрезПоследних
	               |ГДЕ
	               |	ТарифныеСтавкиКонтрагентовСрезПоследних.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ТарифнаяСтавкаСтруктура.Валюта = ВыборкаЗапроса.Валюта;
			ТарифнаяСтавкаСтруктура.Ставка = ВыборкаЗапроса.Значение;
		КонецЦикла;
	КонецЕсли;
	Возврат ТарифнаяСтавкаСтруктура;
КонецФункции

&НаСервере
Функция ОбновитьДанныеВРегистрах(ДанныеКонтрагента,КонтактныеДанныеКонтрагента,ФинансовыеДанные)
	МенеджерЗаписи = РегистрыСведений.ДанныеКонтрагентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Контрагент = Объект.Ссылка;
	МенеджерЗаписи.ИНН = ДанныеКонтрагента.ИНН;
	МенеджерЗаписи.Фамилия = ДанныеКонтрагента.Фамилия;
	МенеджерЗаписи.Имя = ДанныеКонтрагента.Имя;
	МенеджерЗаписи.Отчество = ДанныеКонтрагента.Отчество;
	МенеджерЗаписи.ДатаРождения = ДанныеКонтрагента.ДатаРождения;
	МенеджерЗаписи.Псевдоним = ДанныеКонтрагента.Псевдоним;
	МенеджерЗаписи.Записать();
	//
	МенеджерЗаписи = РегистрыСведений.ТарифныеСтавкиКонтрагентов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Контрагент = Объект.Ссылка;
	МенеджерЗаписи.Валюта = ФинансовыеДанные.Валюта;
	МенеджерЗаписи.Значение = ФинансовыеДанные.Ставка;
	МенеджерЗаписи.Записать();
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.Период КАК Период,
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.КонтактныеДанныеКонтрагентов.СрезПоследних КАК КонтактныеДанныеКонтрагентовСрезПоследних
	               |ГДЕ
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Для Каждого Стр Из КонтактныеДанныеКонтрагента Цикл
			МенеджерЗаписи = РегистрыСведений.КонтактныеДанныеКонтрагентов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Контрагент = Объект.Ссылка;
			МенеджерЗаписи.ВидКонтактнойИнформации = Стр.Ключ;
			МенеджерЗаписи.Значение = Стр.Значение;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	Иначе
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ЭлементНайден = Ложь;
			Для Каждого Стр Из КонтактныеДанныеКонтрагента Цикл
				Если ВыборкаЗапроса.ВидКонтактнойИнформации = Стр.Ключ Тогда
					ЭлементНайден = Истина;
				КонецЕсли;
			КонецЦикла;
			//
			Если Не ЭлементНайден Тогда
				МенеджерЗаписи = РегистрыСведений.КонтактныеДанныеКонтрагентов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ВыборкаЗапроса.Период;
				МенеджерЗаписи.Контрагент = Объект.Ссылка;
				МенеджерЗаписи.ВидКонтактнойИнформации = ВыборкаЗапроса.ВидКонтактнойИнформации;
				МенеджерЗаписи.Значение = ВыборкаЗапроса.Значение;
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;
		//
		Для Каждого Стр Из КонтактныеДанныеКонтрагента Цикл
			МенеджерЗаписи = РегистрыСведений.КонтактныеДанныеКонтрагентов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Контрагент = Объект.Ссылка;
			МенеджерЗаписи.ВидКонтактнойИнформации = Стр.Ключ;
			МенеджерЗаписи.Значение = Стр.Значение;
			МенеджерЗаписи.Записать();	
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьДанныеКонтрагента()
	ДанныеКонтрагента = Новый Структура;
	ДанныеКонтрагента.Вставить("ТипКонтрагента","");
	ДанныеКонтрагента.Вставить("ВидЮридическогоЛица","");
	ДанныеКонтрагента.Вставить("НаименованиеЮридическогоЛица","");
	ДанныеКонтрагента.Вставить("ИНН","");
	ДанныеКонтрагента.Вставить("Фамилия","");
	ДанныеКонтрагента.Вставить("Имя","");
	ДанныеКонтрагента.Вставить("Отчество","");
	ДанныеКонтрагента.Вставить("Псевдоним","");
	ДанныеКонтрагента.Вставить("ДатаРождения","");
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеКонтрагентовСрезПоследних.ТипКонтрагента КАК ТипКонтрагента,
	               |	ДанныеКонтрагентовСрезПоследних.ВидЮридическогоЛица КАК ВидЮридическогоЛица,
	               |	ДанныеКонтрагентовСрезПоследних.НаименованиеЮридическогоЛица КАК НаименованиеЮридическогоЛица,
	               |	ДанныеКонтрагентовСрезПоследних.ИНН КАК ИНН,
	               |	ДанныеКонтрагентовСрезПоследних.Фамилия КАК Фамилия,
	               |	ДанныеКонтрагентовСрезПоследних.Имя КАК Имя,
	               |	ДанныеКонтрагентовСрезПоследних.Отчество КАК Отчество,
	               |	ДанныеКонтрагентовСрезПоследних.Псевдоним КАК Псевдоним,
	               |	ДанныеКонтрагентовСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ДанныеКонтрагентов.СрезПоследних КАК ДанныеКонтрагентовСрезПоследних
	               |ГДЕ
	               |	ДанныеКонтрагентовСрезПоследних.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ДанныеКонтрагента.ТипКонтрагента = ВыборкаЗапроса.ТипКонтрагента;
			ДанныеКонтрагента.ВидЮридическогоЛица = ВыборкаЗапроса.ВидЮридическогоЛица;
			ДанныеКонтрагента.НаименованиеЮридическогоЛица = ВыборкаЗапроса.НаименованиеЮридическогоЛица;
			ДанныеКонтрагента.ИНН = ВыборкаЗапроса.ИНН;
			ДанныеКонтрагента.Фамилия = ВыборкаЗапроса.Фамилия;
			ДанныеКонтрагента.Имя = ВыборкаЗапроса.Имя;
			ДанныеКонтрагента.Отчество = ВыборкаЗапроса.Отчество;
			ДанныеКонтрагента.Псевдоним = ВыборкаЗапроса.Псевдоним;
			ДанныеКонтрагента.ДатаРождения = ВыборкаЗапроса.ДатаРождения;
		КонецЦикла;
	КонецЕсли;
	//
	Возврат ДанныеКонтрагента;
КонецФункции

&НаСервере
Функция ПолучитьКонтактныеДанныеКонтрагента()
	КонтактныеДанныеКонтрагента = Новый Соответствие;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.КонтактныеДанныеКонтрагентов.СрезПоследних КАК КонтактныеДанныеКонтрагентовСрезПоследних
	               |ГДЕ
	               |	КонтактныеДанныеКонтрагентовСрезПоследних.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			КонтактныеДанныеКонтрагента.Вставить(ВыборкаЗапроса.ВидКонтактнойИнформации,ВыборкаЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	//
	Возврат КонтактныеДанныеКонтрагента;
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	ДанныеКонтрагента = ПолучитьДанныеКонтрагента();
	КонтактныеДанныеКонтрагента = ПолучитьКонтактныеДанныеКонтрагента();
	ТарифнаяСтавкаСтруктура = ПолучитьТарифнуюСтавку();
	//
	ТипКонтрагента = ДанныеКонтрагента.ТипКонтрагента;
	Если ТипКонтрагента = Перечисления.ТипыКонтрагентов.ФизическоеЛицо Тогда
		ФизическоеЛицо = Истина;
	ИначеЕсли ТипКонтрагента = Перечисления.ТипыКонтрагентов.ЮридическоеЛицо Тогда
		ЮридическоеЛицо = Истина;
	КонецЕсли;
	//
	ВидЮридическогоЛица = ДанныеКонтрагента.ВидЮридическогоЛица;
	Если ВидЮридическогоЛица = Перечисления.ВидыЮридическихЛиц.НПД Тогда
		НПД = Истина;
	КонецЕсли;
	//
	НаименованиеЮридическогоЛица = ДанныеКонтрагента.НаименованиеЮридическогоЛица; 
	ИНН = ДанныеКонтрагента.ИНН;
	Фамилия = ДанныеКонтрагента.Фамилия;
	Имя = ДанныеКонтрагента.Имя;
	Отчество = ДанныеКонтрагента.Отчество;
	Псевдоним = ДанныеКонтрагента.Псевдоним;
	ДатаРождения = ДанныеКонтрагента.ДатаРождения;
	//
	Для Каждого Стр Из КонтактныеДанныеКонтрагента Цикл
		КД = КонтактныеДанные.Добавить();
		КД.ВидКонтактнойИнформации = Стр.Ключ;
		КД.Значение = Стр.Значение;
	КонецЦикла;
	//
	ТарифнаяСтавка = ТарифнаяСтавкаСтруктура.Ставка;
	ВалютаВзаиморасчётов = ТарифнаяСтавкаСтруктура.Валюта;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Если ФизическоеЛицо Тогда
		ЭтаФорма.Элементы.Наименование.Заголовок = "ФИО";
		ЭтаФорма.Элементы.ВидЮридическогоЛица.Видимость = Ложь;
		ЭтаФорма.Элементы.ИНН.Видимость = Ложь;
	ИначеЕсли ЮридическоеЛицо Тогда
		Если НПД Тогда
			//	
		Иначе
			ЭтаФорма.Элементы.Фамилия.Видимость = Ложь;
			ЭтаФорма.Элементы.Имя.Видимость = Ложь;
			ЭтаФорма.Элементы.Отчество.Видимость = Ложь;
			ЭтаФорма.Элементы.ДатаРождения.Видимость = Ложь;
			ЭтаФорма.Элементы.Псевдоним.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	ЭтаФорма.Элементы.ИНН.ТолькоПросмотр = Не ЭтаФорма.Элементы.ИНН.ТолькоПросмотр;
	ЭтаФорма.Элементы.Фамилия.ТолькоПросмотр = Не ЭтаФорма.Элементы.Фамилия.ТолькоПросмотр;
	ЭтаФорма.Элементы.Имя.ТолькоПросмотр = Не ЭтаФорма.Элементы.Имя.ТолькоПросмотр;
	ЭтаФорма.Элементы.Отчество.ТолькоПросмотр = Не ЭтаФорма.Элементы.Отчество.ТолькоПросмотр;
	ЭтаФорма.Элементы.ДатаРождения.ТолькоПросмотр = Не ЭтаФорма.Элементы.ДатаРождения.ТолькоПросмотр;
	ЭтаФорма.Элементы.Псевдоним.ТолькоПросмотр = Не ЭтаФорма.Элементы.Псевдоним.ТолькоПросмотр;
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Не ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость;
	ЭтаФорма.Элементы.КонтактныеДанные.ТолькоПросмотр = Не ЭтаФорма.Элементы.КонтактныеДанные.ТолькоПросмотр;
	ЭтаФорма.Элементы.ВалютаВзаиморасчётов.ТолькоПросмотр = Не ЭтаФорма.Элементы.ВалютаВзаиморасчётов.ТолькоПросмотр;
	ЭтаФорма.Элементы.ТарифнаяСтавка.ТолькоПросмотр = Не ЭтаФорма.Элементы.ТарифнаяСтавка.ТолькоПросмотр;
	Если ЭтаФорма.Элементы.ТарифнаяСтавка.ТолькоПросмотр Тогда
		ЭтаФорма.Элементы.ВалютаВзаиморасчётов.Вид = ВидПоляФормы.ПолеНадписи;		
	Иначе
		ЭтаФорма.Элементы.ВалютаВзаиморасчётов.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ДанныеКонтрагента = Новый Структура;
	ДанныеКонтрагента.Вставить("ИНН",ИНН);
	ДанныеКонтрагента.Вставить("Фамилия",Фамилия);
	ДанныеКонтрагента.Вставить("Имя",Имя);
	ДанныеКонтрагента.Вставить("Отчество",Отчество);
	ДанныеКонтрагента.Вставить("ДатаРождения",ДатаРождения);
	ДанныеКонтрагента.Вставить("Псевдоним",Псевдоним);
	//
	ФинансовыеДанные = Новый Структура;
	ФинансовыеДанные.Вставить("Валюта",ВалютаВзаиморасчётов);
	ФинансовыеДанные.Вставить("Ставка",ТарифнаяСтавка);
	//
	КонтактныеДанныеКонтрагента = Новый Соответствие;
	Для Каждого Стр Из КонтактныеДанные Цикл
		КонтактныеДанныеКонтрагента.Вставить(Стр.ВидКонтактнойИнформации,Стр.Значение);
	КонецЦикла;
	//
	ОбновитьДанныеВРегистрах(ДанныеКонтрагента,КонтактныеДанныеКонтрагента,ФинансовыеДанные);
	//
	РазрешитьРедактирование = Ложь;	
	ЭтаФорма.Элементы.ИНН.ТолькоПросмотр = Не ЭтаФорма.Элементы.ИНН.ТолькоПросмотр;
	ЭтаФорма.Элементы.Фамилия.ТолькоПросмотр = Не ЭтаФорма.Элементы.Фамилия.ТолькоПросмотр;
	ЭтаФорма.Элементы.Имя.ТолькоПросмотр = Не ЭтаФорма.Элементы.Имя.ТолькоПросмотр;
	ЭтаФорма.Элементы.Отчество.ТолькоПросмотр = Не ЭтаФорма.Элементы.Отчество.ТолькоПросмотр;
	ЭтаФорма.Элементы.ДатаРождения.ТолькоПросмотр = Не ЭтаФорма.Элементы.ДатаРождения.ТолькоПросмотр;
	ЭтаФорма.Элементы.Псевдоним.ТолькоПросмотр = Не ЭтаФорма.Элементы.Псевдоним.ТолькоПросмотр;
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Не ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость;
	ЭтаФорма.Элементы.КонтактныеДанные.ТолькоПросмотр = Не ЭтаФорма.Элементы.КонтактныеДанные.ТолькоПросмотр;
	ЭтаФорма.Элементы.ВалютаВзаиморасчётов.ТолькоПросмотр = Не ЭтаФорма.Элементы.ВалютаВзаиморасчётов.ТолькоПросмотр;
	ЭтаФорма.Элементы.ТарифнаяСтавка.ТолькоПросмотр = Не ЭтаФорма.Элементы.ТарифнаяСтавка.ТолькоПросмотр;
	Если ЭтаФорма.Элементы.ТарифнаяСтавка.ТолькоПросмотр Тогда
		ЭтаФорма.Элементы.ВалютаВзаиморасчётов.Вид = ВидПоляФормы.ПолеНадписи;		
	Иначе
		ЭтаФорма.Элементы.ВалютаВзаиморасчётов.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	ЭтаФорма.Элементы.ГруппаДополнительныеФункции.Скрыть();
	//
	ПоказатьПредупреждение(Новый ОписаниеОповещения,"Данные успешно обновлены!",0,"Редактирование данных");
КонецПроцедуры




