&НаКлиенте
Перем ЗаписатьПередЗакрытием;

&НаСервере
Функция ПолучитьДанныеУслуги(Услуга)
	Данные = Новый Структура;
	Данные.Вставить("ЕдиницаИзмерения",Справочники.ЕдиницыИзмеренияУслуг.ПустаяСсылка());
	Данные.Вставить("Стоимость",0);
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныУслугСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЦеныУслугСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныУслуг.СрезПоследних КАК ЦеныУслугСрезПоследних
	               |ГДЕ
	               |	ЦеныУслугСрезПоследних.Услуга = &Услуга";
	Запрос.УстановитьПараметр("Услуга",Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Данные.ЕдиницаИзмерения = ВыборкаЗапроса.ЕдиницаИзмерения;
		Данные.Стоимость = ВыборкаЗапроса.Цена;
	КонецЦикла;
	//
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	ЭтаФорма.Прочитать();
	//
	ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Не ЭтаФорма.Элементы.Дата.ТолькоПросмотр;
	ЭтаФорма.Элементы.Контрагент.ТолькоПросмотр = Не ЭтаФорма.Элементы.Контрагент.ТолькоПросмотр;
	//ЭтаФорма.Элементы.Услуги.ТолькоПросмотр = Не ЭтаФорма.Элементы.Услуги.ТолькоПросмотр;
	ЭтаФорма.Элементы.СтатусЗаказа.ТолькоПросмотр = Не ЭтаФорма.Элементы.СтатусЗаказа.ТолькоПросмотр;
	ЭтаФорма.Элементы.ВалютаДокумента.ТолькоПросмотр = Не ЭтаФорма.Элементы.ВалютаДокумента.ТолькоПросмотр;
	//
	ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость = Не ЭтаФорма.Элементы.ФормаЗаписатьИзменения.Видимость;
	//
	ЗаписатьПередЗакрытием = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЭтотОбъект.Записать();
	ЭтаФорма.Прочитать();
	//
	РазрешитьРедактирование = Ложь;
	ЭтаФорма.Элементы.ДополнительныеФункции.Скрыть();
	//
	РазрешитьРедактированиеПриИзменении(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчёт(Элемент)
	ТД = ЭтаФорма.Элементы.Услуги.ТекущиеДанные;
	//
	Если Элемент.Имя = "УслугиКоличество" Или Элемент.Имя = "УслугиСтоимость" Тогда
		ТД.Сумма = ТД.Количество*ТД.Стоимость;
	ИначеЕсли Элемент.Имя = "УслугиСумма" Тогда
		ТД.Стоимость = ТД.Сумма/ТД.Количество;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ВыполнитьРасчёт(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьПриИзменении(Элемент)
	ВыполнитьРасчёт(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	ВыполнитьРасчёт(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	ТД = ЭтаФорма.Элементы.Услуги.ТекущиеДанные;
	ДанныеУслуги = ПолучитьДанныеУслуги(ТД.Услуга);
	ТД.ЕдиницаИзмерения = ДанныеУслуги.ЕдиницаИзмерения;
	ТД.Стоимость = ДанныеУслуги.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияФинансовыхОпераций(Команда)
	ОткрытьФорму("ОбщаяФорма.ФинансовыеОперацииПоЗаказу",Новый Структура("Документ",Объект.Ссылка),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура УслугиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//Попытка
		//
		ЭтотОбъект.Записать();
		ЭтаФорма.Прочитать();
		//
	//Исключение
		//
	//КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповестить("ЗаказЗакрыт",Ложь,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаписатьПередЗакрытием = Ложь;
КонецПроцедуры
